export default [
  new WeakMap([
    [
      new URL('ftp://xn--e-sia4a12il07e3qaqd95fe7ata56159aua37s.credit/'),
      /𖫣𖫴𖫵𖫳𖫣𖫔/gis
    ],
    [
      new String('ᜬᜣᜯᜨᜥᜯᜦ'),
      new Map([
        [ Buffer.from('', 'hex'), /𐪝𐪀/imsy ],
        [ new Map([]), /𒓘𒂆𒀖𒍦𒂶𒈷𒂝𒀝𒃻𒊚𒂈𒑒/gimu ],
        [ new Date(1492607711546.6338), new Boolean(true) ],
        [ Buffer.from('', 'hex'), '𐊭𐊽𐊿𐊨𐋎𐋄𐋇𐊯𐊩' ],
        [ new Map([]), true ],
        [
          new WeakRef({
            '𑵫': null,
            'ꥄꥏꥉꥀꥌꥂꤿ꥟ꥄꤽꤲꥀꤳꤻꥒ': null,
            '': null,
            '𐊨𐊾𐊵𐊱𐊮𐋎𐊮': null,
            '𓅁𓄷𓅨𓏊𓁄𓆫𓂮𓃘𓁔𓃊𓍮𓏅𓏤': null,
            '𐔛𐔤𐔚𐔉𐔥𐔝𐔒𐔉𐔍𐔂𐔊𐔟': null
          }),
          -1775343128
        ]
      ])
    ],
    [
      new Uint8Array([
        128, 71, 122, 131,
        221,  5,  42
      ]).buffer,
      2537315107765357003647748040044n
    ],
    [
      new URL('http://xn--6la8mk50fg22kgba.xn--y9a3aq/'),
      new Map([ [ new Map([]), [] ], [ -4009384225n, new Date(1934099187025.8691) ] ])
    ],
    [
      new String('ჴჰⴞᲦდᲵⴕᲰᲘⴭⴔႭႢჇ'),
      new WeakRef(new RangeError('𑶄𑵪𑶠𑶑𑵴𑶠𑵯𑵺𑶖𑵣𑶌𑵧𑶖𑵽𑵴𑶖𑶁𑵱𑵪', { cause: 'BasuraGenerated' }))
    ],
    [
      new Proxy({
        '𐑶𐑾𐑰𐑧𐑭𐑖𐑚𐑻𐑠𐑥𐑬𐑹𐑽𐑩𐑠𐑻𐑜': [],
        'リル㌻ｪ𛀀ィ㌆': Buffer.from('00c8627a03f14a0a5648a63d2d71de07', 'hex'),
        '𐴇': 110745653345001050000,
        'ᬈ᭔ᬞ᭨ᬟᬄᬰ᭦ᬇᬦᬮ᬴': -153079155804149692951986890549834378761n,
        '𖫖𖫰𖫙𖫫𖫨𖫑𖫘𖫣𖫜𖫒': new Map([
          [ undefined, true ],
          [ new Set([]), 2.6858869598142296e-246 ],
          [ new WeakMap([]), null ],
          [ [], /𓌀𓃡𓈊𓄹𓈁𓇄𓌅𓊭𓐄𓏤𓊸𓋜/imy ],
          [ new WeakRef(new Date(1874510617432.8123)), new WeakMap([]) ],
          [ '', -1199408907 ]
        ]),
        '𐼤𐼐𐼘𐼉𐼅𐼁𐼊𐼜𐼟𐼋𐼏𐼟𐼋𐼍𐼑': true,
        '𐼵𐼲': 1483678993
      }, {}),
      new WeakSet([
        /𑻡𑻠𑻯𑻰𑻩𑻭𑻩𑻯𑻧𑻫𑻫𑻦/gmuy,
        new Int16Array([ -32211, 14328, 32305, 20148, 14238 ]),
        new Date(2210353015103.3096),
        new Proxy({
          '⢭⢆⢩': [],
          '𑱔𑰟𑱦𑰸𑱞𑰖𑱗': new ReferenceError('᠐ᠾ᠍ᠯᠽᢨᡠᡔᢂᡫ', { cause: 'BasuraGenerated' }),
          'ꠙꠀꠐꠛꠘꠙꠇꠦꠐꠕꠂꠜꠂꠜꠣꠜꠐꠇ': () => {},
          '𑻰𑻬': new WeakRef(/ꣂꢣꢟꢽꢋꢙꢙꢛꣁ/gu)
        }, {}),
        new Uint8ClampedArray([]),
        {
          'ұЄҸҷѵЁⷦџԕ': -2.8688715082614092e-27,
          '': new WeakRef(new Proxy({
            'ꩵဎၶလႇဇꩳ': null,
            '𐔥𐔈𐔊𐔙𐔎𐔉𐔧𐔛𐔝𐔈𐔧𐔓𐔎𐔐𐔏𐔔': null,
            'ᚗ': null,
            'તધ૨થમઝઅ૽ૈઆૡૺ': null
          }, {})),
          'ᡌᡎᢣᡒᡋᢪ᠕᠇𑙣ᠠ𑙣': new WeakRef([
            null, null,
            null, null,
            null, null,
            null
          ]),
          '𐪋𐪞𐪀𐪏𐪍𐪖𐪃𐪂𐪄𐪛𐪑': Symbol(),
          'նջԶփԷՄւՙ՞ԺՉԳ՝փտՎլ': new WeakRef(new Boolean(false)),
          'ᤗᤶᤳᤗᤵ᥅ᤡ᥍᥎ᤀᤄᤲ᥍ᤎ᤹': true,
          '𐭏𐭂𐭇𐭅𐭌𐭜𐭔𐭁𐭇𐭝': Symbol.for('ⵋⴹ'),
          'ဠꩴꩦꧺꧨဒꧺꩱျႂ': false
        },
        new Map([]),
        [ undefined, null, (function *gen() { yield *[]; }()) ]
      ])
    ],
    [
      (() => { const s = new SharedArrayBuffer(9); const b = Buffer.from(s); Buffer.from([
        100, 36, 109,  41,
         61, 15, 131, 219,
         37
      ]).copy(b); return s })(),
      new Date(1238476300477.2393)
    ],
    [ {}, undefined ]
  ]),
  new WeakMap([
    [
      new Proxy({
        'ᝐ': new Uint16Array([]),
        'ඪ𑇰ලංචගඝ': new BigInt64Array([
          2380497027414036778n,
          5407939457239825816n,
          3144681305249452628n,
          -1084233003653328624n,
          2286425132131426711n,
          -1244552058705716906n
        ]),
        '𐮫𐮫𐮮𐮀𐮬𐮫𐮎𐮂𐮑𐮄𐮍': new SyntaxError('𑊁𑊏𑊥', { cause: 'BasuraGenerated' })
      }, {}),
      /𐪘𐪘𐪕𐪁𐪐𐪜𐪙𐪃𐪇𐪟𐪑𐪐𐪔𐪕𐪆𐪞𐪘𐪘𐪂/gmsuy
    ]
  ])
]
