export default {
  '': new URL('https://xn--t68a33e.bom/'),
  'ՄփՐ՟մ֍ծՠ֊ՊՐ': new Date(2150292518055.3948),
  '𑅣𑅲𑅞𑅟𑅒𑅞𑅔': new WeakRef(new Map([
    [
      new URL('https://xn--bea4d30atu5d.group/#%E2%B1%87%F0%9E%80%84%E2%B1%9C%E2%B1%94%E2%B0%9E%E2%B0%88%E2%B1%81%E2%B1%83%F0%9E%80%8A%F0%9E%80%88%E2%B1%89%F0%9E%80%AA%E2%B0%8D%F0%9E%80%81%E2%B0%B8'),
      new Uint8Array([
        192,  0, 120, 220,
        209, 98, 208
      ]).buffer
    ],
    [
      {
        '𖫥𖫪𖫕𖫭𖫪𖫤𖫵𖫒𖫭𖫦𖫖𖫑𖫑𖫵𖫕𖫩𖫦𖫲': Symbol.for('໐ໃໞ'),
        'ｐꝄOꞶợʛ': 98175059449035612163n,
        '𐡑𐡟𐡙𐡗𐡏𐡅': new WeakRef(new BigUint64Array([
          4949126120118827897n,
          15361832202763064133n,
          2656116705653869252n,
          15656026360558078995n,
          17380504734453883615n,
          8884653946062230044n
        ])),
        '𑰒𑰀𑰑𑰶𑱙𑰐𑰌𑱝𑱠𑱞𑱖𑱪𑱑𑱢': true,
        '𐒐𐒩𐒢𐒩𐒔': new BigInt64Array([
          -5401655525738123914n,
          -8966585066003261562n,
          6185584789681761646n,
          -3102551356166440378n,
          -3118246733044891073n,
          7489748279886406541n
        ]),
        '𐕎𐔴𐔱𐕈𐕢𐕎𐔰𐕙𐕙𐕣𐕜𐕗𐔿𐕢𐕉𐔱': Symbol.for('𑌽𑍁𑍝𑌅𑌊𑌙𑌧𑍍𑍳𑌌𑍇𑌯𑌊'),
        'ꓛꓹ': new Set([ null ]),
        'ꓣꓣꓲꓙꓗꓜꓡꓤꓧ': true,
        '': new Set([ null ])
      },
      new WeakRef(Promise.resolve(new Uint16Array([
        21490, 43731,
        52247,  5515,
        13741,  5629,
        38741
      ])))
    ],
    [
      new BigUint64Array([]),
      Buffer.from('6f3b2569a5c710bda645a87e9a', 'hex')
    ],
    [ true, new WeakMap([]) ],
    [ new DataView(new Uint8Array([ 244 ]).buffer), /џыӸ/ms ],
    [
      '𐐈𐑋𐐦𐐯𐑅𐑉𐐤𐐈𐐒𐑉𐑁𐐅𐐻𐑌𐐄𐐓',
      new Set([
        [ null ],
        new WeakSet([
          Promise.resolve(null),
          Buffer.from('64c6', 'hex'),
          new String('ᜭᜦᜪᜰᜱᜳᜬᜧᜧᜮ'),
          Buffer.from('7b4588451cc0c3214eca', 'hex'),
          Buffer.from('d0bd7783755d994c9ebf5959cb5f6e80b58e', 'hex'),
          [],
          new Date(1783630370390.6226)
        ])
      ])
    ]
  ])),
  'ࡖ࡙࡙ࡍࡆࡓࡍ࡛ࡋࡖ࡚ࡒ': new Number(-6.391349942005313e+28)
}
